from django.db import connection
from .models import ContractTransactionRequirement

def table_exists(table_name):
    return table_name in connection.introspection.table_names()

def create_initial_data(sender, **kwargs):
    if not table_exists("contract_transaction_requirements"):
        return

    data = [
        ("خطاب تشكيل لجنة الاستلام معتمد", 1),
        ("المخططات التنفيذية (As Built) معتمدة PDF–CAD", 1),
        ("الرفوعات المساحية معتمدة PDF – CAD", 1),
        ("أخر جدول كميات معدلة معتمدة", 1),
        ("نسخة من الاختبارات & اعتمادات العينات & طلبات فحص الاعمال", 1),
        ("بيان معتمد لحصر الكميات الختامية", 1),
        ("قاعدة بيانات جغرافية (GIS) موضح بها جميع الأعمال المنفذة", 1),
        ("محضر استلام اعمال", 1),
        ("محضر معاينة امكانية الاستلام", 1),
        ("محضر ملاحظات الاستلام [ان وجد]", 1),
        ("محضر انهاء ملاحظات الاستلام [ان وجد]", 1),

        ("خطاب تشكيل لجنة الاستلام معتمد", 2),
        ("محضر الاستلام الاعمال", 2),
        ("المستخلص الختامي كامل الاعتمادات", 2),
        ("	محضر الاستلام الابتدائي كامل التوقيعات", 2),
        ("إرفاق جميع الملفات المطلوبة والمذكورة بتقرير ملاحظات", 2),
        ("الاستلام الابتدائي [ان وجدت]", 2),

        ("خطاب تشكيل لجنة الاستلام معتمد", 3),
        ("المخططات التنفيذية (As Built) معتمدة PDF–CAD", 3),
        ("الرفوعات المساحية معتمدة PDF – CAD", 3),
        ("أخر جدول كميات معدلة معتمدة", 3),
        ("أخر جدول كميات معدلة معتمدة", 3),
        ("نسخة من الاختبارات & اعتمادات العينات & طلبات فحص الاعمال", 3),
        ("بيان معتمد لحصر الكميات الختامية", 3),
        ("قاعدة بيانات جغرافية (GIS) موضح بها جميع الأعمال المنفذة", 3),
        ("محضر استلام اعمال", 3),
        ("محضر معاينة امكانية الاستلام", 3),
        ("محضر ملاحظات الاستلام [ان وجد]", 3),
        ("محضر انهاء ملاحظات الاستلام [ان وجد]", 3),

    ]

    for name, type_id in data:
        ContractTransactionRequirement.objects.get_or_create(
            name=name,
            type_id=type_id
        )
